In [4]:
import pandas as pd

In [5]:
data=pd.read_csv('terror.csv',encoding='latin-1')

In [6]:
## Q.1) How many attacks happened in India?

In [70]:
id=data['country_txt']=='India'

In [71]:
data[id].shape[0]

9940

In [9]:
## Q.2) How many attacks happened in India and upto 3 people were killed?

In [85]:
req_data=(data['country_txt']=='India') & (data['nkill']==5)
data[req_data].shape[0]

241

In [11]:
## Q.3) Extract the city and summary for attacks above

In [12]:
data[req_data][['city','summary']]

              city                                            summary
1185     New Delhi                                                NaN
3780     New Delhi                                                NaN
5251        Bombay                                                NaN
7266        Imphal                                                NaN
8609       Unknown                                                NaN
...            ...                                                ...
156695       Terem  12/29/2015: Assailants abducted three students...
156698  Peravurani  12/29/2015: An explosive device was discovered...
156713   Tulsibari  12/29/2015: Assailants abducted Hazrat Ali in ...
156725     Zhutovi  12/30/2015: Assailants attempted to extort mon...
156756    Srinagar  12/31/2015: Assailants threw a grenade at an I...

[8362 rows x 2 columns]

In [13]:
## Q.4) In a single terror incident in India, find out top 5 cities by number killed

In [14]:

required_data=data[id].groupby('city').agg({'nkill':'max'})

In [15]:
required_data.sort_values('nkill',ascending=False).head(5)

                    nkill
city
Mumbai              188.0
Jhargam             115.0
Bombay              115.0
Dantewada district   82.0
Banabari             70.0

In [16]:
## Q.5) In a single terror incident in India, find out top 5 cities by number killed and wounded

In [94]:
id=data['country_txt']=='India'

In [95]:
required_data2=data[id].groupby('city').agg({'nkill':'max','nwound':'max'})

In [96]:
required_data2.sort_values(['nkill','nwound'],ascending=[False,False]).head(5)

                    nkill  nwound
city
Mumbai              188.0   817.0
Jhargam             115.0   140.0
Bombay              115.0    34.0
Dantewada district   82.0    25.0
Banabari             70.0   100.0

In [19]:
## Q.6) How many attacks were successful that were suicide attacks?

In [20]:
req_ans=(data['success']==1)&(data['suicide']!=0)

In [21]:
data[req_ans].head()

,eventid,iyear,imonth,iday,country_txt,region_txt,provstate,city,location,summary,success,suicide,nkill,nwound
14954,1.980000e+11,1981,12,15,Lebanon,Middle East & North Africa,Beirut,Beirut,NaN,NaN,1,1,66.0,100.0
17351,1.980000e+11,1982,11,11,Lebanon,Middle East & North Africa,South,Tyre district,An Israeli military headquarters located on th...,11/11/1982: A suspected suicide car bomb deton...,1,1,89.0,NaN
18496,1.980000e+11,1983,4,18,Lebanon,Middle East & North Africa,Beirut,Beirut,NaN,NaN,1,1,63.0,120.0
19999,1.980000e+11,1983,10,23,Lebanon,Middle East & North Africa,Beirut,Beirut,NaN,NaN,1,1,241.0,75.0
20000,1.980000e+11,1983,10,23,Lebanon,Middle East & North Africa,Beirut,Beirut,NaN,NaN,1,1,58.0,0.0

In [22]:
## Q.7) Label all the incidents where the number killed was more than 5 as severe.

In [23]:
def fun(nkill):
    if nkill > 5:
        return 'Severe'
    else:
        return 'Not Severe'

In [24]:
data['severity'] = data['nkill'].map(fun)

In [25]:
data.head(2)

,eventid,iyear,imonth,iday,country_txt,region_txt,provstate,city,location,summary,success,suicide,nkill,nwound,severity
0,1.970000e+11,1970,0,0,Dominican Republic,Central America & Caribbean,NaN,Santo Domingo,NaN,NaN,1,0,1.0,0.0,Not Severe
1,1.970000e+11,1970,0,0,Mexico,North America,NaN,Mexico city,NaN,NaN,1,0,0.0,0.0,Not Severe

In [26]:
data['severity'].unique()

array(['Not Severe', 'Severe'], dtype=object)

In [27]:
## Q.8) write a function to label an incident that was both successful and suicidal

In [28]:
def successful_and_suicidal(value):
    if value['success'] == 1 and value['suicide'] == 1:
        return 'successful and suicidal'
    else:
        return 'other'
data['label'] = data.apply(successful_and_suicidal, axis=1)

In [29]:
data.head(2)

,eventid,iyear,imonth,iday,country_txt,region_txt,provstate,city,location,summary,success,suicide,nkill,nwound,severity,label
0,1.970000e+11,1970,0,0,Dominican Republic,Central America & Caribbean,NaN,Santo Domingo,NaN,NaN,1,0,1.0,0.0,Not Severe,other
1,1.970000e+11,1970,0,0,Mexico,North America,NaN,Mexico city,NaN,NaN,1,0,0.0,0.0,Not Severe,other

In [30]:
## Q.9) Create a new category representing if the incident occurred in Afghanistan, Pakistan or India as one level of the category and all the other countries as another level. Label all other countries as ROW and new column which contains the new category as â€˜Localâ€™ in the data.

In [31]:
def local_or_not(country):
    if country['country_txt']=='Afghanistan' or country['country_txt']=='India' or country['country_txt']=='Pakistan':
        return 'local'
    else:
        return 'row'
data['local']=data.apply(local_or_not,axis=1)

In [32]:
data.head(2)

,eventid,iyear,imonth,iday,country_txt,region_txt,provstate,city,location,summary,success,suicide,nkill,nwound,severity,label,local
0,1.970000e+11,1970,0,0,Dominican Republic,Central America & Caribbean,NaN,Santo Domingo,NaN,NaN,1,0,1.0,0.0,Not Severe,other,row
1,1.970000e+11,1970,0,0,Mexico,North America,NaN,Mexico city,NaN,NaN,1,0,0.0,0.0,Not Severe,other,row

In [33]:
## Q.10) How many incidents happened in Af-Pak-India vs ROW?

In [34]:
local_data=data['local']=='local'

In [35]:
data[local_data].shape[0]

32398

In [36]:
row_data=data['local']=='row'

In [37]:
data[row_data].shape[0]

124374

##  2nd file: stackoverflow.csv

In [38]:
data2=pd.read_csv('stackoverflow.csv')

In [39]:
## Q1. How many rows and columns are present?

In [40]:
data2.shape

(6991, 23)

In [41]:
## Q2. How many missing values are present?

In [42]:
data2.isnull().sum()

RespondentID                               0
Country                                    0
Salary                                     0
YearsCodedJob                              0
OpenSource                                 0
Hobby                                      0
CompanySizeNumber                         31
Remote                                     0
CareerSatisfaction                         0
Datascientist                              0
Database administrator                     0
Desktop applications developer             0
Developer with stats/math background       0
DevOps                                     0
Embedded developer                         0
Graphic designer                           0
Graphics programming                       0
Machine learning specialist                0
Mobile developer                           0
Quality assurance engineer                 0
Systems administrator                      0
Web developer                              0
                                        6991
dtype: int64

In [43]:
## Q3. How many unique countries are in the dataframe stackoverflow.

In [44]:
data2['Country'].unique()

array(['United Kingdom', 'United States', 'Germany', 'India', 'Canada'],
      dtype=object)

In [45]:
data2['Country'].nunique()

5

In [46]:
##Q4. There are ________ Indian Data Scientists present in the data.

In [47]:
requ_data=(data2['Country']=='India')&(data2['Datascientist']!=0)

In [48]:
data2[requ_data].head().shape[0]

5

In [49]:
##Q5. ______ respondents work remotely in this data.

In [50]:
req_dat=data2['Remote']=='Remote'

In [51]:
data2[req_dat].shape[0]

718

In [52]:
## Q6. _______ is the count of Germans who have more than 10 years of coding experience.

In [53]:
req_data=(data2['Country']=='Germany')&(data2['YearsCodedJob']>10)

In [54]:
data2[req_data].shape[0]

181

In [55]:
##Q7. Which Country has maximum average Salary?

In [56]:
req_data=data2.groupby('Country').agg({'Salary':'mean'})

In [57]:
req_data.head(1)

               Salary
Country
Canada   58226.407451

In [58]:
## Q8. Country ________ has least remote workers

In [59]:
data2.groupby('Country').agg({'Remote':'count'}).sort_values('Remote',ascending=True).head(1)

         Remote
Country
Canada      619

In [60]:
##Q9. ____% is the percentage of Mobile Developers in the data.

In [61]:
mob_dev=data2['Mobile developer']==1

In [62]:
mobdev=mob_dev.sum()

In [63]:
total=len(data)

In [64]:
percentage=(mobdev/total)*100

In [65]:
print('percentage of mobile developers in the data is '+str(percentage))

percentage of mobile developers in the data is 0.8649503737912382

In [66]:
##Q10. ____ is the number of profiles who are Mobile Developers and Web Developers and who work remotely?

In [67]:
req_data=data2[(data2['Mobile developer']==1)&(data2['Web developer']==1)&(data2['Remote']=='Remote')].shape[0]

In [68]:
print(str(req_data)+' is the number of profiles who are mobile developers and web developers and who work remotely')

115 is the number of profiles who are mobile developers and web developers and who work remotely